NicPare/GBM2100/Laboratoire3.cydsn/Generated_Source/PSoC6/CapSense_RegisterMap.h
#define CapSense_MOD_CSX_CLK_VALUE                          (CapSense_dsRam.modCsxClk)
#define CapSense_MOD_CSX_CLK_OFFSET                         (31u)
#define CapSense_MOD_CSX_CLK_SIZE                           (1u)
#define CapSense_MOD_CSX_CLK_PARAM_ID                       (0x6580001Fu)

#define CapSense_BUTTONR_RESOLUTION_VALUE                   (CapSense_dsRam.wdgtList.buttonr.resolution)
#define CapSense_BUTTONR_RESOLUTION_OFFSET                  (32u)
#define CapSense_BUTTONR_RESOLUTION_SIZE                    (2u)
#define CapSense_BUTTONR_RESOLUTION_PARAM_ID                (0xAB800020u)

#define CapSense_BUTTONR_FINGER_TH_VALUE                    (CapSense_dsRam.wdgtList.buttonr.fingerTh)
#define CapSense_BUTTONR_FINGER_TH_OFFSET                   (34u)
#define CapSense_BUTTONR_FINGER_TH_SIZE                     (2u)
#define CapSense_BUTTONR_FINGER_TH_PARAM_ID                 (0xA7800022u)

#define CapSense_BUTTONR_NOISE_TH_VALUE                     (CapSense_dsRam.wdgtList.buttonr.noiseTh)
#define CapSense_BUTTONR_NOISE_TH_OFFSET                    (36u)
#define CapSense_BUTTONR_NOISE_TH_SIZE                      (1u)
#define CapSense_BUTTONR_NOISE_TH_PARAM_ID                  (0x62800024u)

#define CapSense_BUTTONR_NNOISE_TH_VALUE                    (CapSense_dsRam.wdgtList.buttonr.nNoiseTh)
#define CapSense_BUTTONR_NNOISE_TH_OFFSET                   (37u)
#define CapSense_BUTTONR_NNOISE_TH_SIZE                     (1u)
#define CapSense_BUTTONR_NNOISE_TH_PARAM_ID                 (0x64800025u)

#define CapSense_BUTTONR_HYSTERESIS_VALUE                   (CapSense_dsRam.wdgtList.buttonr.hysteresis)
#define CapSense_BUTTONR_HYSTERESIS_OFFSET                  (38u)
#define CapSense_BUTTONR_HYSTERESIS_SIZE                    (1u)
#define CapSense_BUTTONR_HYSTERESIS_PARAM_ID                (0x6E800026u)

#define CapSense_BUTTONR_ON_DEBOUNCE_VALUE                  (CapSense_dsRam.wdgtList.buttonr.onDebounce)
#define CapSense_BUTTONR_ON_DEBOUNCE_OFFSET                 (39u)
#define CapSense_BUTTONR_ON_DEBOUNCE_SIZE                   (1u)
#define CapSense_BUTTONR_ON_DEBOUNCE_PARAM_ID               (0x68800027u)

#define CapSense_BUTTONR_LOW_BSLN_RST_VALUE                 (CapSense_dsRam.wdgtList.buttonr.lowBslnRst)
#define CapSense_BUTTONR_LOW_BSLN_RST_OFFSET                (40u)
#define CapSense_BUTTONR_LOW_BSLN_RST_SIZE                  (1u)
#define CapSense_BUTTONR_LOW_BSLN_RST_PARAM_ID              (0x61800028u)

#define CapSense_BUTTONR_IDAC_MOD0_VALUE                    (CapSense_dsRam.wdgtList.buttonr.idacMod[0u])
#define CapSense_BUTTONR_IDAC_MOD0_OFFSET                   (41u)
#define CapSense_BUTTONR_IDAC_MOD0_SIZE                     (1u)
#define CapSense_BUTTONR_IDAC_MOD0_PARAM_ID                 (0x41000029u)

#define CapSense_BUTTONR_SNS_CLK_VALUE                      (CapSense_dsRam.wdgtList.buttonr.snsClk)
#define CapSense_BUTTONR_SNS_CLK_OFFSET                     (42u)
#define CapSense_BUTTONR_SNS_CLK_SIZE                       (2u)
#define CapSense_BUTTONR_SNS_CLK_PARAM_ID                   (0xA580002Au)

#define CapSense_BUTTONR_SNS_CLK_SOURCE_VALUE               (CapSense_dsRam.wdgtList.buttonr.snsClkSource)
#define CapSense_BUTTONR_SNS_CLK_SOURCE_OFFSET              (44u)
#define CapSense_BUTTONR_SNS_CLK_SOURCE_SIZE                (1u)
#define CapSense_BUTTONR_SNS_CLK_SOURCE_PARAM_ID            (0x4B80002Cu)

#define CapSense_BUTTONR_FINGER_CAP_VALUE                   (CapSense_dsRam.wdgtList.buttonr.fingerCap)
#define CapSense_BUTTONR_FINGER_CAP_OFFSET                  (46u)
#define CapSense_BUTTONR_FINGER_CAP_SIZE                    (2u)
#define CapSense_BUTTONR_FINGER_CAP_PARAM_ID                (0xA900002Eu)

#define CapSense_BUTTONR_SIGPFC_VALUE                       (CapSense_dsRam.wdgtList.buttonr.sigPFC)
#define CapSense_BUTTONR_SIGPFC_OFFSET                      (48u)
#define CapSense_BUTTONR_SIGPFC_SIZE                        (2u)
#define CapSense_BUTTONR_SIGPFC_PARAM_ID                    (0xA3000030u)

#define CapSense_BUTTONR_GESTURE_ID_VALUE                   (CapSense_dsRam.wdgtList.buttonr.gestureId)
#define CapSense_BUTTONR_GESTURE_ID_OFFSET                  (50u)
#define CapSense_BUTTONR_GESTURE_ID_SIZE                    (1u)
#define CapSense_BUTTONR_GESTURE_ID_PARAM_ID                (0x67000032u)

#define CapSense_BUTTONL_RESOLUTION_VALUE                   (CapSense_dsRam.wdgtList.buttonl.resolution)
#define CapSense_BUTTONL_RESOLUTION_OFFSET                  (52u)
#define CapSense_BUTTONL_RESOLUTION_SIZE                    (2u)
#define CapSense_BUTTONL_RESOLUTION_PARAM_ID                (0xAC810034u)

#define CapSense_BUTTONL_FINGER_TH_VALUE                    (CapSense_dsRam.wdgtList.buttonl.fingerTh)
#define CapSense_BUTTONL_FINGER_TH_OFFSET                   (54u)
#define CapSense_BUTTONL_FINGER_TH_SIZE                     (2u)
#define CapSense_BUTTONL_FINGER_TH_PARAM_ID                 (0xA0810036u)

#define CapSense_BUTTONL_NOISE_TH_VALUE                     (CapSense_dsRam.wdgtList.buttonl.noiseTh)
#define CapSense_BUTTONL_NOISE_TH_OFFSET                    (56u)
#define CapSense_BUTTONL_NOISE_TH_SIZE                      (1u)
#define CapSense_BUTTONL_NOISE_TH_PARAM_ID                  (0x67810038u)

#define CapSense_BUTTONL_NNOISE_TH_VALUE                    (CapSense_dsRam.wdgtList.buttonl.nNoiseTh)
#define CapSense_BUTTONL_NNOISE_TH_OFFSET                   (57u)
#define CapSense_BUTTONL_NNOISE_TH_SIZE                     (1u)
#define CapSense_BUTTONL_NNOISE_TH_PARAM_ID                 (0x61810039u)

#define CapSense_BUTTONL_HYSTERESIS_VALUE                   (CapSense_dsRam.wdgtList.buttonl.hysteresis)
#define CapSense_BUTTONL_HYSTERESIS_OFFSET                  (58u)
#define CapSense_BUTTONL_HYSTERESIS_SIZE                    (1u)
#define CapSense_BUTTONL_HYSTERESIS_PARAM_ID                (0x6B81003Au)

#define CapSense_BUTTONL_ON_DEBOUNCE_VALUE                  (CapSense_dsRam.wdgtList.buttonl.onDebounce)
#define CapSense_BUTTONL_ON_DEBOUNCE_OFFSET                 (59u)
#define CapSense_BUTTONL_ON_DEBOUNCE_SIZE                   (1u)
#define CapSense_BUTTONL_ON_DEBOUNCE_PARAM_ID               (0x6D81003Bu)

#define CapSense_BUTTONL_LOW_BSLN_RST_VALUE                 (CapSense_dsRam.wdgtList.buttonl.lowBslnRst)
#define CapSense_BUTTONL_LOW_BSLN_RST_OFFSET                (60u)
#define CapSense_BUTTONL_LOW_BSLN_RST_SIZE                  (1u)
#define CapSense_BUTTONL_LOW_BSLN_RST_PARAM_ID              (0x6681003Cu)

#define CapSense_BUTTONL_IDAC_MOD0_VALUE                    (CapSense_dsRam.wdgtList.buttonl.idacMod[0u])
#define CapSense_BUTTONL_IDAC_MOD0_OFFSET                   (61u)
#define CapSense_BUTTONL_IDAC_MOD0_SIZE                     (1u)
#define CapSense_BUTTONL_IDAC_MOD0_PARAM_ID                 (0x4601003Du)

