NicPare/GBM2100/Laboratoire3.cydsn/Generated_Source/PSoC6/CapSense_RegisterMap.h
#define CapSense_BUTTONL_SNS_CLK_VALUE                      (CapSense_dsRam.wdgtList.buttonl.snsClk)
#define CapSense_BUTTONL_SNS_CLK_OFFSET                     (62u)
#define CapSense_BUTTONL_SNS_CLK_SIZE                       (2u)
#define CapSense_BUTTONL_SNS_CLK_PARAM_ID                   (0xA281003Eu)

#define CapSense_BUTTONL_SNS_CLK_SOURCE_VALUE               (CapSense_dsRam.wdgtList.buttonl.snsClkSource)
#define CapSense_BUTTONL_SNS_CLK_SOURCE_OFFSET              (64u)
#define CapSense_BUTTONL_SNS_CLK_SOURCE_SIZE                (1u)
#define CapSense_BUTTONL_SNS_CLK_SOURCE_PARAM_ID            (0x4C810040u)

#define CapSense_BUTTONL_FINGER_CAP_VALUE                   (CapSense_dsRam.wdgtList.buttonl.fingerCap)
#define CapSense_BUTTONL_FINGER_CAP_OFFSET                  (66u)
#define CapSense_BUTTONL_FINGER_CAP_SIZE                    (2u)
#define CapSense_BUTTONL_FINGER_CAP_PARAM_ID                (0xAE010042u)

#define CapSense_BUTTONL_SIGPFC_VALUE                       (CapSense_dsRam.wdgtList.buttonl.sigPFC)
#define CapSense_BUTTONL_SIGPFC_OFFSET                      (68u)
#define CapSense_BUTTONL_SIGPFC_SIZE                        (2u)
#define CapSense_BUTTONL_SIGPFC_PARAM_ID                    (0xA3010044u)

#define CapSense_BUTTONL_GESTURE_ID_VALUE                   (CapSense_dsRam.wdgtList.buttonl.gestureId)
#define CapSense_BUTTONL_GESTURE_ID_OFFSET                  (70u)
#define CapSense_BUTTONL_GESTURE_ID_SIZE                    (1u)
#define CapSense_BUTTONL_GESTURE_ID_PARAM_ID                (0x67010046u)

#define CapSense_LINEARSLIDER0_RESOLUTION_VALUE             (CapSense_dsRam.wdgtList.linearslider0.resolution)
#define CapSense_LINEARSLIDER0_RESOLUTION_OFFSET            (72u)
#define CapSense_LINEARSLIDER0_RESOLUTION_SIZE              (2u)
#define CapSense_LINEARSLIDER0_RESOLUTION_PARAM_ID          (0x83820048u)

#define CapSense_LINEARSLIDER0_FINGER_TH_VALUE              (CapSense_dsRam.wdgtList.linearslider0.fingerTh)
#define CapSense_LINEARSLIDER0_FINGER_TH_OFFSET             (74u)
#define CapSense_LINEARSLIDER0_FINGER_TH_SIZE               (2u)
#define CapSense_LINEARSLIDER0_FINGER_TH_PARAM_ID           (0x8F82004Au)

#define CapSense_LINEARSLIDER0_NOISE_TH_VALUE               (CapSense_dsRam.wdgtList.linearslider0.noiseTh)
#define CapSense_LINEARSLIDER0_NOISE_TH_OFFSET              (76u)
#define CapSense_LINEARSLIDER0_NOISE_TH_SIZE                (1u)
#define CapSense_LINEARSLIDER0_NOISE_TH_PARAM_ID            (0x4A82004Cu)

#define CapSense_LINEARSLIDER0_NNOISE_TH_VALUE              (CapSense_dsRam.wdgtList.linearslider0.nNoiseTh)
#define CapSense_LINEARSLIDER0_NNOISE_TH_OFFSET             (77u)
#define CapSense_LINEARSLIDER0_NNOISE_TH_SIZE               (1u)
#define CapSense_LINEARSLIDER0_NNOISE_TH_PARAM_ID           (0x4C82004Du)

#define CapSense_LINEARSLIDER0_HYSTERESIS_VALUE             (CapSense_dsRam.wdgtList.linearslider0.hysteresis)
#define CapSense_LINEARSLIDER0_HYSTERESIS_OFFSET            (78u)
#define CapSense_LINEARSLIDER0_HYSTERESIS_SIZE              (1u)
#define CapSense_LINEARSLIDER0_HYSTERESIS_PARAM_ID          (0x4682004Eu)

#define CapSense_LINEARSLIDER0_ON_DEBOUNCE_VALUE            (CapSense_dsRam.wdgtList.linearslider0.onDebounce)
#define CapSense_LINEARSLIDER0_ON_DEBOUNCE_OFFSET           (79u)
#define CapSense_LINEARSLIDER0_ON_DEBOUNCE_SIZE             (1u)
#define CapSense_LINEARSLIDER0_ON_DEBOUNCE_PARAM_ID         (0x4082004Fu)

#define CapSense_LINEARSLIDER0_LOW_BSLN_RST_VALUE           (CapSense_dsRam.wdgtList.linearslider0.lowBslnRst)
#define CapSense_LINEARSLIDER0_LOW_BSLN_RST_OFFSET          (80u)
#define CapSense_LINEARSLIDER0_LOW_BSLN_RST_SIZE            (1u)
#define CapSense_LINEARSLIDER0_LOW_BSLN_RST_PARAM_ID        (0x4C820050u)

#define CapSense_LINEARSLIDER0_IDAC_MOD0_VALUE              (CapSense_dsRam.wdgtList.linearslider0.idacMod[0u])
#define CapSense_LINEARSLIDER0_IDAC_MOD0_OFFSET             (81u)
#define CapSense_LINEARSLIDER0_IDAC_MOD0_SIZE               (1u)
#define CapSense_LINEARSLIDER0_IDAC_MOD0_PARAM_ID           (0x47020051u)

#define CapSense_LINEARSLIDER0_SNS_CLK_VALUE                (CapSense_dsRam.wdgtList.linearslider0.snsClk)
#define CapSense_LINEARSLIDER0_SNS_CLK_OFFSET               (82u)
#define CapSense_LINEARSLIDER0_SNS_CLK_SIZE                 (2u)
#define CapSense_LINEARSLIDER0_SNS_CLK_PARAM_ID             (0x88820052u)

#define CapSense_LINEARSLIDER0_SNS_CLK_SOURCE_VALUE         (CapSense_dsRam.wdgtList.linearslider0.snsClkSource)
#define CapSense_LINEARSLIDER0_SNS_CLK_SOURCE_OFFSET        (84u)
#define CapSense_LINEARSLIDER0_SNS_CLK_SOURCE_SIZE          (1u)
#define CapSense_LINEARSLIDER0_SNS_CLK_SOURCE_PARAM_ID      (0x4D820054u)

#define CapSense_LINEARSLIDER0_FINGER_CAP_VALUE             (CapSense_dsRam.wdgtList.linearslider0.fingerCap)
#define CapSense_LINEARSLIDER0_FINGER_CAP_OFFSET            (86u)
#define CapSense_LINEARSLIDER0_FINGER_CAP_SIZE              (2u)
#define CapSense_LINEARSLIDER0_FINGER_CAP_PARAM_ID          (0xAF020056u)

#define CapSense_LINEARSLIDER0_SIGPFC_VALUE                 (CapSense_dsRam.wdgtList.linearslider0.sigPFC)
#define CapSense_LINEARSLIDER0_SIGPFC_OFFSET                (88u)
#define CapSense_LINEARSLIDER0_SIGPFC_SIZE                  (2u)
#define CapSense_LINEARSLIDER0_SIGPFC_PARAM_ID              (0xA0020058u)

#define CapSense_LINEARSLIDER0_GESTURE_ID_VALUE             (CapSense_dsRam.wdgtList.linearslider0.gestureId)
#define CapSense_LINEARSLIDER0_GESTURE_ID_OFFSET            (90u)
#define CapSense_LINEARSLIDER0_GESTURE_ID_SIZE              (1u)
#define CapSense_LINEARSLIDER0_GESTURE_ID_PARAM_ID          (0x6402005Au)

#define CapSense_LINEARSLIDER0_POSITION0_VALUE              (CapSense_dsRam.wdgtList.linearslider0.position[0u])
#define CapSense_LINEARSLIDER0_POSITION0_OFFSET             (92u)
#define CapSense_LINEARSLIDER0_POSITION0_SIZE               (2u)
#define CapSense_LINEARSLIDER0_POSITION0_PARAM_ID           (0x8A02005Cu)

#define CapSense_BUTTONR_RX0_RAW0_VALUE                     (CapSense_dsRam.snsList.buttonr[0u].raw[0u])
#define CapSense_BUTTONR_RX0_RAW0_OFFSET                    (94u)
#define CapSense_BUTTONR_RX0_RAW0_SIZE                      (2u)
#define CapSense_BUTTONR_RX0_RAW0_PARAM_ID                  (0x8000005Eu)

#define CapSense_BUTTONR_RX0_BSLN0_VALUE                    (CapSense_dsRam.snsList.buttonr[0u].bsln[0u])
#define CapSense_BUTTONR_RX0_BSLN0_OFFSET                   (96u)
#define CapSense_BUTTONR_RX0_BSLN0_SIZE                     (2u)
#define CapSense_BUTTONR_RX0_BSLN0_PARAM_ID                 (0x80000060u)

