NicPare/GBM2100/Laboratoire3.cydsn/Generated_Source/PSoC6/CapSense_RegisterMap.h
#define CapSense_BUTTONR_RX0_BSLN_EXT0_VALUE                (CapSense_dsRam.snsList.buttonr[0u].bslnExt[0u])
#define CapSense_BUTTONR_RX0_BSLN_EXT0_OFFSET               (98u)
#define CapSense_BUTTONR_RX0_BSLN_EXT0_SIZE                 (1u)
#define CapSense_BUTTONR_RX0_BSLN_EXT0_PARAM_ID             (0x44000062u)

#define CapSense_BUTTONR_RX0_DIFF_VALUE                     (CapSense_dsRam.snsList.buttonr[0u].diff)
#define CapSense_BUTTONR_RX0_DIFF_OFFSET                    (100u)
#define CapSense_BUTTONR_RX0_DIFF_SIZE                      (2u)
#define CapSense_BUTTONR_RX0_DIFF_PARAM_ID                  (0x81000064u)

#define CapSense_BUTTONR_RX0_NEG_BSLN_RST_CNT0_VALUE        (CapSense_dsRam.snsList.buttonr[0u].negBslnRstCnt[0u])
#define CapSense_BUTTONR_RX0_NEG_BSLN_RST_CNT0_OFFSET       (102u)
#define CapSense_BUTTONR_RX0_NEG_BSLN_RST_CNT0_SIZE         (1u)
#define CapSense_BUTTONR_RX0_NEG_BSLN_RST_CNT0_PARAM_ID     (0x45000066u)

#define CapSense_BUTTONR_RX0_IDAC_COMP0_VALUE               (CapSense_dsRam.snsList.buttonr[0u].idacComp[0u])
#define CapSense_BUTTONR_RX0_IDAC_COMP0_OFFSET              (103u)
#define CapSense_BUTTONR_RX0_IDAC_COMP0_SIZE                (1u)
#define CapSense_BUTTONR_RX0_IDAC_COMP0_PARAM_ID            (0x43000067u)

#define CapSense_BUTTONL_RX0_RAW0_VALUE                     (CapSense_dsRam.snsList.buttonl[0u].raw[0u])
#define CapSense_BUTTONL_RX0_RAW0_OFFSET                    (104u)
#define CapSense_BUTTONL_RX0_RAW0_SIZE                      (2u)
#define CapSense_BUTTONL_RX0_RAW0_PARAM_ID                  (0x82000068u)

#define CapSense_BUTTONL_RX0_BSLN0_VALUE                    (CapSense_dsRam.snsList.buttonl[0u].bsln[0u])
#define CapSense_BUTTONL_RX0_BSLN0_OFFSET                   (106u)
#define CapSense_BUTTONL_RX0_BSLN0_SIZE                     (2u)
#define CapSense_BUTTONL_RX0_BSLN0_PARAM_ID                 (0x8E00006Au)

#define CapSense_BUTTONL_RX0_BSLN_EXT0_VALUE                (CapSense_dsRam.snsList.buttonl[0u].bslnExt[0u])
#define CapSense_BUTTONL_RX0_BSLN_EXT0_OFFSET               (108u)
#define CapSense_BUTTONL_RX0_BSLN_EXT0_SIZE                 (1u)
#define CapSense_BUTTONL_RX0_BSLN_EXT0_PARAM_ID             (0x4B00006Cu)

#define CapSense_BUTTONL_RX0_DIFF_VALUE                     (CapSense_dsRam.snsList.buttonl[0u].diff)
#define CapSense_BUTTONL_RX0_DIFF_OFFSET                    (110u)
#define CapSense_BUTTONL_RX0_DIFF_SIZE                      (2u)
#define CapSense_BUTTONL_RX0_DIFF_PARAM_ID                  (0x8F00006Eu)

#define CapSense_BUTTONL_RX0_NEG_BSLN_RST_CNT0_VALUE        (CapSense_dsRam.snsList.buttonl[0u].negBslnRstCnt[0u])
#define CapSense_BUTTONL_RX0_NEG_BSLN_RST_CNT0_OFFSET       (112u)
#define CapSense_BUTTONL_RX0_NEG_BSLN_RST_CNT0_SIZE         (1u)
#define CapSense_BUTTONL_RX0_NEG_BSLN_RST_CNT0_PARAM_ID     (0x4D000070u)

#define CapSense_BUTTONL_RX0_IDAC_COMP0_VALUE               (CapSense_dsRam.snsList.buttonl[0u].idacComp[0u])
#define CapSense_BUTTONL_RX0_IDAC_COMP0_OFFSET              (113u)
#define CapSense_BUTTONL_RX0_IDAC_COMP0_SIZE                (1u)
#define CapSense_BUTTONL_RX0_IDAC_COMP0_PARAM_ID            (0x4B000071u)

#define CapSense_LINEARSLIDER0_SNS0_RAW0_VALUE              (CapSense_dsRam.snsList.linearslider0[0u].raw[0u])
#define CapSense_LINEARSLIDER0_SNS0_RAW0_OFFSET             (114u)
#define CapSense_LINEARSLIDER0_SNS0_RAW0_SIZE               (2u)
#define CapSense_LINEARSLIDER0_SNS0_RAW0_PARAM_ID           (0x89000072u)

#define CapSense_LINEARSLIDER0_SNS0_BSLN0_VALUE             (CapSense_dsRam.snsList.linearslider0[0u].bsln[0u])
#define CapSense_LINEARSLIDER0_SNS0_BSLN0_OFFSET            (116u)
#define CapSense_LINEARSLIDER0_SNS0_BSLN0_SIZE              (2u)
#define CapSense_LINEARSLIDER0_SNS0_BSLN0_PARAM_ID          (0x84000074u)

#define CapSense_LINEARSLIDER0_SNS0_BSLN_EXT0_VALUE         (CapSense_dsRam.snsList.linearslider0[0u].bslnExt[0u])
#define CapSense_LINEARSLIDER0_SNS0_BSLN_EXT0_OFFSET        (118u)
#define CapSense_LINEARSLIDER0_SNS0_BSLN_EXT0_SIZE          (1u)
#define CapSense_LINEARSLIDER0_SNS0_BSLN_EXT0_PARAM_ID      (0x40000076u)

#define CapSense_LINEARSLIDER0_SNS0_DIFF_VALUE              (CapSense_dsRam.snsList.linearslider0[0u].diff)
#define CapSense_LINEARSLIDER0_SNS0_DIFF_OFFSET             (120u)
#define CapSense_LINEARSLIDER0_SNS0_DIFF_SIZE               (2u)
#define CapSense_LINEARSLIDER0_SNS0_DIFF_PARAM_ID           (0x87000078u)

#define CapSense_LINEARSLIDER0_SNS0_NEG_BSLN_RST_CNT0_VALUE (CapSense_dsRam.snsList.linearslider0[0u].negBslnRstCnt[0u])
#define CapSense_LINEARSLIDER0_SNS0_NEG_BSLN_RST_CNT0_OFFSET (122u)
#define CapSense_LINEARSLIDER0_SNS0_NEG_BSLN_RST_CNT0_SIZE  (1u)
#define CapSense_LINEARSLIDER0_SNS0_NEG_BSLN_RST_CNT0_PARAM_ID (0x4300007Au)

#define CapSense_LINEARSLIDER0_SNS0_IDAC_COMP0_VALUE        (CapSense_dsRam.snsList.linearslider0[0u].idacComp[0u])
#define CapSense_LINEARSLIDER0_SNS0_IDAC_COMP0_OFFSET       (123u)
#define CapSense_LINEARSLIDER0_SNS0_IDAC_COMP0_SIZE         (1u)
#define CapSense_LINEARSLIDER0_SNS0_IDAC_COMP0_PARAM_ID     (0x4500007Bu)

#define CapSense_LINEARSLIDER0_SNS1_RAW0_VALUE              (CapSense_dsRam.snsList.linearslider0[1u].raw[0u])
#define CapSense_LINEARSLIDER0_SNS1_RAW0_OFFSET             (124u)
#define CapSense_LINEARSLIDER0_SNS1_RAW0_SIZE               (2u)
#define CapSense_LINEARSLIDER0_SNS1_RAW0_PARAM_ID           (0x8600007Cu)

#define CapSense_LINEARSLIDER0_SNS1_BSLN0_VALUE             (CapSense_dsRam.snsList.linearslider0[1u].bsln[0u])
#define CapSense_LINEARSLIDER0_SNS1_BSLN0_OFFSET            (126u)
#define CapSense_LINEARSLIDER0_SNS1_BSLN0_SIZE              (2u)
#define CapSense_LINEARSLIDER0_SNS1_BSLN0_PARAM_ID          (0x8A00007Eu)

#define CapSense_LINEARSLIDER0_SNS1_BSLN_EXT0_VALUE         (CapSense_dsRam.snsList.linearslider0[1u].bslnExt[0u])
#define CapSense_LINEARSLIDER0_SNS1_BSLN_EXT0_OFFSET        (128u)
#define CapSense_LINEARSLIDER0_SNS1_BSLN_EXT0_SIZE          (1u)
#define CapSense_LINEARSLIDER0_SNS1_BSLN_EXT0_PARAM_ID      (0x4C000080u)

#define CapSense_LINEARSLIDER0_SNS1_DIFF_VALUE              (CapSense_dsRam.snsList.linearslider0[1u].diff)
#define CapSense_LINEARSLIDER0_SNS1_DIFF_OFFSET             (130u)
#define CapSense_LINEARSLIDER0_SNS1_DIFF_SIZE               (2u)
#define CapSense_LINEARSLIDER0_SNS1_DIFF_PARAM_ID           (0x88000082u)

#define CapSense_LINEARSLIDER0_SNS1_NEG_BSLN_RST_CNT0_VALUE (CapSense_dsRam.snsList.linearslider0[1u].negBslnRstCnt[0u])
#define CapSense_LINEARSLIDER0_SNS1_NEG_BSLN_RST_CNT0_OFFSET (132u)
#define CapSense_LINEARSLIDER0_SNS1_NEG_BSLN_RST_CNT0_SIZE  (1u)
#define CapSense_LINEARSLIDER0_SNS1_NEG_BSLN_RST_CNT0_PARAM_ID (0x4D000084u)

