NicPare/GBM2100/Laboratoire3.cydsn/Generated_Source/PSoC6/CapSense_RegisterMap.h
#define CapSense_LINEARSLIDER0_STFK_YPOS_TH_VALUE           (CapSense_dsRam.gestures.flickActiveDistanceY)
#define CapSense_LINEARSLIDER0_STFK_YPOS_TH_OFFSET          (170u)
#define CapSense_LINEARSLIDER0_STFK_YPOS_TH_SIZE            (1u)
#define CapSense_LINEARSLIDER0_STFK_YPOS_TH_PARAM_ID        (0x650200AAu)

#define CapSense_LINEARSLIDER0_STSL_XPOS_TH1_VALUE          (CapSense_dsRam.gestures.stScrollThreshold1X)
#define CapSense_LINEARSLIDER0_STSL_XPOS_TH1_OFFSET         (171u)
#define CapSense_LINEARSLIDER0_STSL_XPOS_TH1_SIZE           (1u)
#define CapSense_LINEARSLIDER0_STSL_XPOS_TH1_PARAM_ID       (0x630200ABu)

#define CapSense_LINEARSLIDER0_STSL_XPOS_TH2_VALUE          (CapSense_dsRam.gestures.stScrollThreshold2X)
#define CapSense_LINEARSLIDER0_STSL_XPOS_TH2_OFFSET         (172u)
#define CapSense_LINEARSLIDER0_STSL_XPOS_TH2_SIZE           (1u)
#define CapSense_LINEARSLIDER0_STSL_XPOS_TH2_PARAM_ID       (0x680200ACu)

#define CapSense_LINEARSLIDER0_STSL_XPOS_TH3_VALUE          (CapSense_dsRam.gestures.stScrollThreshold3X)
#define CapSense_LINEARSLIDER0_STSL_XPOS_TH3_OFFSET         (173u)
#define CapSense_LINEARSLIDER0_STSL_XPOS_TH3_SIZE           (1u)
#define CapSense_LINEARSLIDER0_STSL_XPOS_TH3_PARAM_ID       (0x6E0200ADu)

#define CapSense_LINEARSLIDER0_STSL_XPOS_TH4_VALUE          (CapSense_dsRam.gestures.stScrollThreshold4X)
#define CapSense_LINEARSLIDER0_STSL_XPOS_TH4_OFFSET         (174u)
#define CapSense_LINEARSLIDER0_STSL_XPOS_TH4_SIZE           (1u)
#define CapSense_LINEARSLIDER0_STSL_XPOS_TH4_PARAM_ID       (0x640200AEu)

#define CapSense_LINEARSLIDER0_STSL_YPOS_TH1_VALUE          (CapSense_dsRam.gestures.stScrollThreshold1Y)
#define CapSense_LINEARSLIDER0_STSL_YPOS_TH1_OFFSET         (175u)
#define CapSense_LINEARSLIDER0_STSL_YPOS_TH1_SIZE           (1u)
#define CapSense_LINEARSLIDER0_STSL_YPOS_TH1_PARAM_ID       (0x620200AFu)

#define CapSense_LINEARSLIDER0_STSL_YPOS_TH2_VALUE          (CapSense_dsRam.gestures.stScrollThreshold2Y)
#define CapSense_LINEARSLIDER0_STSL_YPOS_TH2_OFFSET         (176u)
#define CapSense_LINEARSLIDER0_STSL_YPOS_TH2_SIZE           (1u)
#define CapSense_LINEARSLIDER0_STSL_YPOS_TH2_PARAM_ID       (0x6E0200B0u)

#define CapSense_LINEARSLIDER0_STSL_YPOS_TH3_VALUE          (CapSense_dsRam.gestures.stScrollThreshold3Y)
#define CapSense_LINEARSLIDER0_STSL_YPOS_TH3_OFFSET         (177u)
#define CapSense_LINEARSLIDER0_STSL_YPOS_TH3_SIZE           (1u)
#define CapSense_LINEARSLIDER0_STSL_YPOS_TH3_PARAM_ID       (0x680200B1u)

#define CapSense_LINEARSLIDER0_STSL_YPOS_TH4_VALUE          (CapSense_dsRam.gestures.stScrollThreshold4Y)
#define CapSense_LINEARSLIDER0_STSL_YPOS_TH4_OFFSET         (178u)
#define CapSense_LINEARSLIDER0_STSL_YPOS_TH4_SIZE           (1u)
#define CapSense_LINEARSLIDER0_STSL_YPOS_TH4_PARAM_ID       (0x620200B2u)

#define CapSense_LINEARSLIDER0_STSL_SCROLL_STEP1_VALUE      (CapSense_dsRam.gestures.stScrollStep1)
#define CapSense_LINEARSLIDER0_STSL_SCROLL_STEP1_OFFSET     (179u)
#define CapSense_LINEARSLIDER0_STSL_SCROLL_STEP1_SIZE       (1u)
#define CapSense_LINEARSLIDER0_STSL_SCROLL_STEP1_PARAM_ID   (0x640200B3u)

#define CapSense_LINEARSLIDER0_STSL_SCROLL_STEP2_VALUE      (CapSense_dsRam.gestures.stScrollStep2)
#define CapSense_LINEARSLIDER0_STSL_SCROLL_STEP2_OFFSET     (180u)
#define CapSense_LINEARSLIDER0_STSL_SCROLL_STEP2_SIZE       (1u)
#define CapSense_LINEARSLIDER0_STSL_SCROLL_STEP2_PARAM_ID   (0x6F0200B4u)

#define CapSense_LINEARSLIDER0_STSL_SCROLL_STEP3_VALUE      (CapSense_dsRam.gestures.stScrollStep3)
#define CapSense_LINEARSLIDER0_STSL_SCROLL_STEP3_OFFSET     (181u)
#define CapSense_LINEARSLIDER0_STSL_SCROLL_STEP3_SIZE       (1u)
#define CapSense_LINEARSLIDER0_STSL_SCROLL_STEP3_PARAM_ID   (0x690200B5u)

#define CapSense_LINEARSLIDER0_STSL_SCROLL_STEP4_VALUE      (CapSense_dsRam.gestures.stScrollStep4)
#define CapSense_LINEARSLIDER0_STSL_SCROLL_STEP4_OFFSET     (182u)
#define CapSense_LINEARSLIDER0_STSL_SCROLL_STEP4_SIZE       (1u)
#define CapSense_LINEARSLIDER0_STSL_SCROLL_STEP4_PARAM_ID   (0x630200B6u)

#define CapSense_LINEARSLIDER0_STSL_DEBOUNCE_VALUE          (CapSense_dsRam.gestures.stScrollDebounce)
#define CapSense_LINEARSLIDER0_STSL_DEBOUNCE_OFFSET         (183u)
#define CapSense_LINEARSLIDER0_STSL_DEBOUNCE_SIZE           (1u)
#define CapSense_LINEARSLIDER0_STSL_DEBOUNCE_PARAM_ID       (0x650200B7u)

#define CapSense_LINEARSLIDER0_DTSL_XPOS_TH1_VALUE          (CapSense_dsRam.gestures.dtScrollThreshold1X)
#define CapSense_LINEARSLIDER0_DTSL_XPOS_TH1_OFFSET         (184u)
#define CapSense_LINEARSLIDER0_DTSL_XPOS_TH1_SIZE           (1u)
#define CapSense_LINEARSLIDER0_DTSL_XPOS_TH1_PARAM_ID       (0x6C0200B8u)

#define CapSense_LINEARSLIDER0_DTSL_XPOS_TH2_VALUE          (CapSense_dsRam.gestures.dtScrollThreshold2X)
#define CapSense_LINEARSLIDER0_DTSL_XPOS_TH2_OFFSET         (185u)
#define CapSense_LINEARSLIDER0_DTSL_XPOS_TH2_SIZE           (1u)
#define CapSense_LINEARSLIDER0_DTSL_XPOS_TH2_PARAM_ID       (0x6A0200B9u)

#define CapSense_LINEARSLIDER0_DTSL_XPOS_TH3_VALUE          (CapSense_dsRam.gestures.dtScrollThreshold3X)
#define CapSense_LINEARSLIDER0_DTSL_XPOS_TH3_OFFSET         (186u)
#define CapSense_LINEARSLIDER0_DTSL_XPOS_TH3_SIZE           (1u)
#define CapSense_LINEARSLIDER0_DTSL_XPOS_TH3_PARAM_ID       (0x600200BAu)

#define CapSense_LINEARSLIDER0_DTSL_XPOS_TH4_VALUE          (CapSense_dsRam.gestures.dtScrollThreshold4X)
#define CapSense_LINEARSLIDER0_DTSL_XPOS_TH4_OFFSET         (187u)
#define CapSense_LINEARSLIDER0_DTSL_XPOS_TH4_SIZE           (1u)
#define CapSense_LINEARSLIDER0_DTSL_XPOS_TH4_PARAM_ID       (0x660200BBu)

#define CapSense_LINEARSLIDER0_DTSL_YPOS_TH1_VALUE          (CapSense_dsRam.gestures.dtScrollThreshold1Y)
#define CapSense_LINEARSLIDER0_DTSL_YPOS_TH1_OFFSET         (188u)
#define CapSense_LINEARSLIDER0_DTSL_YPOS_TH1_SIZE           (1u)
#define CapSense_LINEARSLIDER0_DTSL_YPOS_TH1_PARAM_ID       (0x6D0200BCu)

#define CapSense_LINEARSLIDER0_DTSL_YPOS_TH2_VALUE          (CapSense_dsRam.gestures.dtScrollThreshold2Y)
#define CapSense_LINEARSLIDER0_DTSL_YPOS_TH2_OFFSET         (189u)
#define CapSense_LINEARSLIDER0_DTSL_YPOS_TH2_SIZE           (1u)
#define CapSense_LINEARSLIDER0_DTSL_YPOS_TH2_PARAM_ID       (0x6B0200BDu)

#define CapSense_LINEARSLIDER0_DTSL_YPOS_TH3_VALUE          (CapSense_dsRam.gestures.dtScrollThreshold3Y)
#define CapSense_LINEARSLIDER0_DTSL_YPOS_TH3_OFFSET         (190u)
#define CapSense_LINEARSLIDER0_DTSL_YPOS_TH3_SIZE           (1u)
#define CapSense_LINEARSLIDER0_DTSL_YPOS_TH3_PARAM_ID       (0x610200BEu)

#define CapSense_LINEARSLIDER0_DTSL_YPOS_TH4_VALUE          (CapSense_dsRam.gestures.dtScrollThreshold4Y)
#define CapSense_LINEARSLIDER0_DTSL_YPOS_TH4_OFFSET         (191u)
#define CapSense_LINEARSLIDER0_DTSL_YPOS_TH4_SIZE           (1u)
#define CapSense_LINEARSLIDER0_DTSL_YPOS_TH4_PARAM_ID       (0x670200BFu)

#define CapSense_LINEARSLIDER0_DTSL_SCROLL_STEP1_VALUE      (CapSense_dsRam.gestures.dtScrollStep1)
#define CapSense_LINEARSLIDER0_DTSL_SCROLL_STEP1_OFFSET     (192u)
#define CapSense_LINEARSLIDER0_DTSL_SCROLL_STEP1_SIZE       (1u)
#define CapSense_LINEARSLIDER0_DTSL_SCROLL_STEP1_PARAM_ID   (0x6C0200C0u)

#define CapSense_LINEARSLIDER0_DTSL_SCROLL_STEP2_VALUE      (CapSense_dsRam.gestures.dtScrollStep2)
#define CapSense_LINEARSLIDER0_DTSL_SCROLL_STEP2_OFFSET     (193u)
#define CapSense_LINEARSLIDER0_DTSL_SCROLL_STEP2_SIZE       (1u)
#define CapSense_LINEARSLIDER0_DTSL_SCROLL_STEP2_PARAM_ID   (0x6A0200C1u)

#define CapSense_LINEARSLIDER0_DTSL_SCROLL_STEP3_VALUE      (CapSense_dsRam.gestures.dtScrollStep3)
#define CapSense_LINEARSLIDER0_DTSL_SCROLL_STEP3_OFFSET     (194u)
#define CapSense_LINEARSLIDER0_DTSL_SCROLL_STEP3_SIZE       (1u)
#define CapSense_LINEARSLIDER0_DTSL_SCROLL_STEP3_PARAM_ID   (0x600200C2u)

#define CapSense_LINEARSLIDER0_DTSL_SCROLL_STEP4_VALUE      (CapSense_dsRam.gestures.dtScrollStep4)
#define CapSense_LINEARSLIDER0_DTSL_SCROLL_STEP4_OFFSET     (195u)
#define CapSense_LINEARSLIDER0_DTSL_SCROLL_STEP4_SIZE       (1u)
#define CapSense_LINEARSLIDER0_DTSL_SCROLL_STEP4_PARAM_ID   (0x660200C3u)

#define CapSense_LINEARSLIDER0_DTSL_DEBOUNCE_VALUE          (CapSense_dsRam.gestures.dtScrollDebounce)
#define CapSense_LINEARSLIDER0_DTSL_DEBOUNCE_OFFSET         (196u)
#define CapSense_LINEARSLIDER0_DTSL_DEBOUNCE_SIZE           (1u)
#define CapSense_LINEARSLIDER0_DTSL_DEBOUNCE_PARAM_ID       (0x6D0200C4u)

#define CapSense_LINEARSLIDER0_DTZM_SCROLL_ZOOM_DEBOUNCE_VALUE (CapSense_dsRam.gestures.dtScrollToZoomDebounce)
#define CapSense_LINEARSLIDER0_DTZM_SCROLL_ZOOM_DEBOUNCE_OFFSET (197u)
#define CapSense_LINEARSLIDER0_DTZM_SCROLL_ZOOM_DEBOUNCE_SIZE (1u)
#define CapSense_LINEARSLIDER0_DTZM_SCROLL_ZOOM_DEBOUNCE_PARAM_ID (0x6B0200C5u)

#define CapSense_LINEARSLIDER0_STSL_XPOS_TH_VALUE           (CapSense_dsRam.gestures.stInScrActiveDistanceX)
#define CapSense_LINEARSLIDER0_STSL_XPOS_TH_OFFSET          (198u)
#define CapSense_LINEARSLIDER0_STSL_XPOS_TH_SIZE            (1u)
#define CapSense_LINEARSLIDER0_STSL_XPOS_TH_PARAM_ID        (0x610200C6u)

#define CapSense_LINEARSLIDER0_STSL_YPOS_TH_VALUE           (CapSense_dsRam.gestures.stInScrActiveDistanceY)
#define CapSense_LINEARSLIDER0_STSL_YPOS_TH_OFFSET          (199u)
#define CapSense_LINEARSLIDER0_STSL_YPOS_TH_SIZE            (1u)
#define CapSense_LINEARSLIDER0_STSL_YPOS_TH_PARAM_ID        (0x670200C7u)

#define CapSense_LINEARSLIDER0_STSL_COUNT_LEVEL_VALUE       (CapSense_dsRam.gestures.stInScrCountLevel)
#define CapSense_LINEARSLIDER0_STSL_COUNT_LEVEL_OFFSET      (200u)
#define CapSense_LINEARSLIDER0_STSL_COUNT_LEVEL_SIZE        (1u)
#define CapSense_LINEARSLIDER0_STSL_COUNT_LEVEL_PARAM_ID    (0x6E0200C8u)

#define CapSense_LINEARSLIDER0_DTSL_XPOS_TH_VALUE           (CapSense_dsRam.gestures.dtInScrActiveDistanceX)
#define CapSense_LINEARSLIDER0_DTSL_XPOS_TH_OFFSET          (201u)
#define CapSense_LINEARSLIDER0_DTSL_XPOS_TH_SIZE            (1u)
#define CapSense_LINEARSLIDER0_DTSL_XPOS_TH_PARAM_ID        (0x680200C9u)

#define CapSense_LINEARSLIDER0_DTSL_YPOS_TH_VALUE           (CapSense_dsRam.gestures.dtInScrActiveDistanceY)
#define CapSense_LINEARSLIDER0_DTSL_YPOS_TH_OFFSET          (202u)
#define CapSense_LINEARSLIDER0_DTSL_YPOS_TH_SIZE            (1u)
#define CapSense_LINEARSLIDER0_DTSL_YPOS_TH_PARAM_ID        (0x620200CAu)

#define CapSense_LINEARSLIDER0_DTSL_COUNT_LEVEL_VALUE       (CapSense_dsRam.gestures.dtInScrCountLevel)
#define CapSense_LINEARSLIDER0_DTSL_COUNT_LEVEL_OFFSET      (203u)
#define CapSense_LINEARSLIDER0_DTSL_COUNT_LEVEL_SIZE        (1u)
#define CapSense_LINEARSLIDER0_DTSL_COUNT_LEVEL_PARAM_ID    (0x640200CBu)

