NicPare/GBM2100/Laboratoire3.cydsn/Generated_Source/PSoC6/CapSense_RegisterMap.h
#define CapSense_LINEARSLIDER0_STES_POS_TH_VALUE            (CapSense_dsRam.gestures.edgeSwipeActiveDistance)
#define CapSense_LINEARSLIDER0_STES_POS_TH_OFFSET           (204u)
#define CapSense_LINEARSLIDER0_STES_POS_TH_SIZE             (1u)
#define CapSense_LINEARSLIDER0_STES_POS_TH_PARAM_ID         (0x6F0200CCu)

#define CapSense_LINEARSLIDER0_STES_TOP_ANGLE_TH_VALUE      (CapSense_dsRam.gestures.topAngleThreshold)
#define CapSense_LINEARSLIDER0_STES_TOP_ANGLE_TH_OFFSET     (205u)
#define CapSense_LINEARSLIDER0_STES_TOP_ANGLE_TH_SIZE       (1u)
#define CapSense_LINEARSLIDER0_STES_TOP_ANGLE_TH_PARAM_ID   (0x690200CDu)

#define CapSense_LINEARSLIDER0_STES_BOTTOM_ANGLE_TH_VALUE   (CapSense_dsRam.gestures.bottomAngleThreshold)
#define CapSense_LINEARSLIDER0_STES_BOTTOM_ANGLE_TH_OFFSET  (206u)
#define CapSense_LINEARSLIDER0_STES_BOTTOM_ANGLE_TH_SIZE    (1u)
#define CapSense_LINEARSLIDER0_STES_BOTTOM_ANGLE_TH_PARAM_ID (0x630200CEu)

#define CapSense_LINEARSLIDER0_STES_DISAM_AREA_WIDTH_VALUE  (CapSense_dsRam.gestures.widthOfDisambiguation)
#define CapSense_LINEARSLIDER0_STES_DISAM_AREA_WIDTH_OFFSET (207u)
#define CapSense_LINEARSLIDER0_STES_DISAM_AREA_WIDTH_SIZE   (1u)
#define CapSense_LINEARSLIDER0_STES_DISAM_AREA_WIDTH_PARAM_ID (0x650200CFu)

#define CapSense_LINEARSLIDER0_ST_PAN_DEBOUNCE_VALUE        (CapSense_dsRam.gestures.stPanDebounce)
#define CapSense_LINEARSLIDER0_ST_PAN_DEBOUNCE_OFFSET       (208u)
#define CapSense_LINEARSLIDER0_ST_PAN_DEBOUNCE_SIZE         (1u)
#define CapSense_LINEARSLIDER0_ST_PAN_DEBOUNCE_PARAM_ID     (0x690200D0u)

#define CapSense_LINEARSLIDER0_DT_PAN_DEBOUNCE_VALUE        (CapSense_dsRam.gestures.dtPanDebounce)
#define CapSense_LINEARSLIDER0_DT_PAN_DEBOUNCE_OFFSET       (209u)
#define CapSense_LINEARSLIDER0_DT_PAN_DEBOUNCE_SIZE         (1u)
#define CapSense_LINEARSLIDER0_DT_PAN_DEBOUNCE_PARAM_ID     (0x6F0200D1u)

#define CapSense_LINEARSLIDER0_DTZM_DEBOUNCE_VALUE          (CapSense_dsRam.gestures.dtZoomDebounce)
#define CapSense_LINEARSLIDER0_DTZM_DEBOUNCE_OFFSET         (210u)
#define CapSense_LINEARSLIDER0_DTZM_DEBOUNCE_SIZE           (1u)
#define CapSense_LINEARSLIDER0_DTZM_DEBOUNCE_PARAM_ID       (0x650200D2u)

#define CapSense_LINEARSLIDER0_DT_PAN_TO_ZOOM_DEBOUNCE_VALUE (CapSense_dsRam.gestures.dtPanToZoomDebounce)
#define CapSense_LINEARSLIDER0_DT_PAN_TO_ZOOM_DEBOUNCE_OFFSET (211u)
#define CapSense_LINEARSLIDER0_DT_PAN_TO_ZOOM_DEBOUNCE_SIZE (1u)
#define CapSense_LINEARSLIDER0_DT_PAN_TO_ZOOM_DEBOUNCE_PARAM_ID (0x630200D3u)

#define CapSense_LINEARSLIDER0_STRT_ROTATE_DEBOUNCE_VALUE   (CapSense_dsRam.gestures.rotateDebounce)
#define CapSense_LINEARSLIDER0_STRT_ROTATE_DEBOUNCE_OFFSET  (212u)
#define CapSense_LINEARSLIDER0_STRT_ROTATE_DEBOUNCE_SIZE    (1u)
#define CapSense_LINEARSLIDER0_STRT_ROTATE_DEBOUNCE_PARAM_ID (0x680200D4u)

#define CapSense_LINEARSLIDER0_COMPLETED_DEBOUNCE_VALUE     (CapSense_dsRam.gestures.completedDebounce)
#define CapSense_LINEARSLIDER0_COMPLETED_DEBOUNCE_OFFSET    (213u)
#define CapSense_LINEARSLIDER0_COMPLETED_DEBOUNCE_SIZE      (1u)
#define CapSense_LINEARSLIDER0_COMPLETED_DEBOUNCE_PARAM_ID  (0x6E0200D5u)

#define CapSense_LINEARSLIDER0_STDC_MAX_RADIUS_DISPLACEMENT_VALUE (CapSense_dsRam.gestures.doubleClickRadius)
#define CapSense_LINEARSLIDER0_STDC_MAX_RADIUS_DISPLACEMENT_OFFSET (214u)
#define CapSense_LINEARSLIDER0_STDC_MAX_RADIUS_DISPLACEMENT_SIZE (1u)
#define CapSense_LINEARSLIDER0_STDC_MAX_RADIUS_DISPLACEMENT_PARAM_ID (0x640200D6u)

#define CapSense_LINEARSLIDER0_STSC_XMAX_POS_DISPLACEMENT_VALUE (CapSense_dsRam.gestures.clickRadiusX)
#define CapSense_LINEARSLIDER0_STSC_XMAX_POS_DISPLACEMENT_OFFSET (215u)
#define CapSense_LINEARSLIDER0_STSC_XMAX_POS_DISPLACEMENT_SIZE (1u)
#define CapSense_LINEARSLIDER0_STSC_XMAX_POS_DISPLACEMENT_PARAM_ID (0x620200D7u)

#define CapSense_LINEARSLIDER0_STSC_YMAX_POS_DISPLACEMENT_VALUE (CapSense_dsRam.gestures.clickRadiusY)
#define CapSense_LINEARSLIDER0_STSC_YMAX_POS_DISPLACEMENT_OFFSET (216u)
#define CapSense_LINEARSLIDER0_STSC_YMAX_POS_DISPLACEMENT_SIZE (1u)
#define CapSense_LINEARSLIDER0_STSC_YMAX_POS_DISPLACEMENT_PARAM_ID (0x6B0200D8u)

#define CapSense_LINEARSLIDER0_DT_SETTLING_TIME_VALUE       (CapSense_dsRam.gestures.settlingTimeout)
#define CapSense_LINEARSLIDER0_DT_SETTLING_TIME_OFFSET      (218u)
#define CapSense_LINEARSLIDER0_DT_SETTLING_TIME_SIZE        (2u)
#define CapSense_LINEARSLIDER0_DT_SETTLING_TIME_PARAM_ID    (0xAF0200DAu)

#define CapSense_LINEARSLIDER0_GES_X_RESOLUTION_VALUE       (CapSense_dsRam.gestures.resolutionX)
#define CapSense_LINEARSLIDER0_GES_X_RESOLUTION_OFFSET      (220u)
#define CapSense_LINEARSLIDER0_GES_X_RESOLUTION_SIZE        (2u)
#define CapSense_LINEARSLIDER0_GES_X_RESOLUTION_PARAM_ID    (0xA20200DCu)

#define CapSense_LINEARSLIDER0_GES_Y_RESOLUTION_VALUE       (CapSense_dsRam.gestures.resolutionY)
#define CapSense_LINEARSLIDER0_GES_Y_RESOLUTION_OFFSET      (222u)
#define CapSense_LINEARSLIDER0_GES_Y_RESOLUTION_SIZE        (2u)
#define CapSense_LINEARSLIDER0_GES_Y_RESOLUTION_PARAM_ID    (0xAE0200DEu)

#define CapSense_LINEARSLIDER0_STFK_MAX_SAMPLE_INTERVAL_VALUE (CapSense_dsRam.gestures.flickSampleTime)
#define CapSense_LINEARSLIDER0_STFK_MAX_SAMPLE_INTERVAL_OFFSET (224u)
#define CapSense_LINEARSLIDER0_STFK_MAX_SAMPLE_INTERVAL_SIZE (2u)
#define CapSense_LINEARSLIDER0_STFK_MAX_SAMPLE_INTERVAL_PARAM_ID (0xAE0200E0u)

#define CapSense_LINEARSLIDER0_STES_TIMEOUT_INTERVAL_VALUE  (CapSense_dsRam.gestures.edgeSwipeTimeout)
#define CapSense_LINEARSLIDER0_STES_TIMEOUT_INTERVAL_OFFSET (226u)
#define CapSense_LINEARSLIDER0_STES_TIMEOUT_INTERVAL_SIZE   (2u)
#define CapSense_LINEARSLIDER0_STES_TIMEOUT_INTERVAL_PARAM_ID (0xA20200E2u)

#define CapSense_LINEARSLIDER0_DTSC_MAX_TOUCH_DURATION_VALUE (CapSense_dsRam.gestures.dtClickTimeoutMax)
#define CapSense_LINEARSLIDER0_DTSC_MAX_TOUCH_DURATION_OFFSET (228u)
#define CapSense_LINEARSLIDER0_DTSC_MAX_TOUCH_DURATION_SIZE (2u)
#define CapSense_LINEARSLIDER0_DTSC_MAX_TOUCH_DURATION_PARAM_ID (0xAF0200E4u)

#define CapSense_LINEARSLIDER0_DTSC_MIN_TOUCH_DURATION_VALUE (CapSense_dsRam.gestures.dtClickTimeoutMin)
#define CapSense_LINEARSLIDER0_DTSC_MIN_TOUCH_DURATION_OFFSET (230u)
#define CapSense_LINEARSLIDER0_DTSC_MIN_TOUCH_DURATION_SIZE (2u)
#define CapSense_LINEARSLIDER0_DTSC_MIN_TOUCH_DURATION_PARAM_ID (0xA30200E6u)

#define CapSense_LINEARSLIDER0_STSC_MAX_TOUCH_DURATION_VALUE (CapSense_dsRam.gestures.stClickTimeoutMax)
#define CapSense_LINEARSLIDER0_STSC_MAX_TOUCH_DURATION_OFFSET (232u)
#define CapSense_LINEARSLIDER0_STSC_MAX_TOUCH_DURATION_SIZE (2u)
#define CapSense_LINEARSLIDER0_STSC_MAX_TOUCH_DURATION_PARAM_ID (0xAC0200E8u)

#define CapSense_LINEARSLIDER0_STSC_MIN_TOUCH_DURATION_VALUE (CapSense_dsRam.gestures.stClickTimeoutMin)
#define CapSense_LINEARSLIDER0_STSC_MIN_TOUCH_DURATION_OFFSET (234u)
#define CapSense_LINEARSLIDER0_STSC_MIN_TOUCH_DURATION_SIZE (2u)
#define CapSense_LINEARSLIDER0_STSC_MIN_TOUCH_DURATION_PARAM_ID (0xA00200EAu)

#define CapSense_LINEARSLIDER0_STDC_MAX_TOUCH_INTERVAL_VALUE (CapSense_dsRam.gestures.stDoubleClickTimeoutMax)
#define CapSense_LINEARSLIDER0_STDC_MAX_TOUCH_INTERVAL_OFFSET (236u)
#define CapSense_LINEARSLIDER0_STDC_MAX_TOUCH_INTERVAL_SIZE (2u)
#define CapSense_LINEARSLIDER0_STDC_MAX_TOUCH_INTERVAL_PARAM_ID (0xAD0200ECu)

#define CapSense_LINEARSLIDER0_STDC_MIN_TOUCH_INTERVAL_VALUE (CapSense_dsRam.gestures.stDoubleClickTimeoutMin)
#define CapSense_LINEARSLIDER0_STDC_MIN_TOUCH_INTERVAL_OFFSET (238u)
#define CapSense_LINEARSLIDER0_STDC_MIN_TOUCH_INTERVAL_SIZE (2u)
#define CapSense_LINEARSLIDER0_STDC_MIN_TOUCH_INTERVAL_PARAM_ID (0xA10200EEu)

#define CapSense_LINEARSLIDER0_GROUP_MASK_VALUE             (CapSense_dsRam.gestures.groupMask)
#define CapSense_LINEARSLIDER0_GROUP_MASK_OFFSET            (240u)
#define CapSense_LINEARSLIDER0_GROUP_MASK_SIZE              (1u)
#define CapSense_LINEARSLIDER0_GROUP_MASK_PARAM_ID          (0x630200F0u)

