NicPare/GBM2100/Laboratoire3.cydsn/Generated_Source/PSoC6/CapSense_RegisterMap.h
#define CapSense_LINEARSLIDER0_GROUP1_START_VALUE           (CapSense_dsRam.gestures.group1Start)
#define CapSense_LINEARSLIDER0_GROUP1_START_OFFSET          (241u)
#define CapSense_LINEARSLIDER0_GROUP1_START_SIZE            (1u)
#define CapSense_LINEARSLIDER0_GROUP1_START_PARAM_ID        (0x650200F1u)

#define CapSense_LINEARSLIDER0_GROUP1_END_VALUE             (CapSense_dsRam.gestures.group1End)
#define CapSense_LINEARSLIDER0_GROUP1_END_OFFSET            (242u)
#define CapSense_LINEARSLIDER0_GROUP1_END_SIZE              (1u)
#define CapSense_LINEARSLIDER0_GROUP1_END_PARAM_ID          (0x6F0200F2u)

#define CapSense_LINEARSLIDER0_GROUP2_START_VALUE           (CapSense_dsRam.gestures.group2Start)
#define CapSense_LINEARSLIDER0_GROUP2_START_OFFSET          (243u)
#define CapSense_LINEARSLIDER0_GROUP2_START_SIZE            (1u)
#define CapSense_LINEARSLIDER0_GROUP2_START_PARAM_ID        (0x690200F3u)

#define CapSense_LINEARSLIDER0_GROUP2_END_VALUE             (CapSense_dsRam.gestures.group2End)
#define CapSense_LINEARSLIDER0_GROUP2_END_OFFSET            (244u)
#define CapSense_LINEARSLIDER0_GROUP2_END_SIZE              (1u)
#define CapSense_LINEARSLIDER0_GROUP2_END_PARAM_ID          (0x620200F4u)

#define CapSense_LINEARSLIDER0_GROUP3_START_VALUE           (CapSense_dsRam.gestures.group3Start)
#define CapSense_LINEARSLIDER0_GROUP3_START_OFFSET          (245u)
#define CapSense_LINEARSLIDER0_GROUP3_START_SIZE            (1u)
#define CapSense_LINEARSLIDER0_GROUP3_START_PARAM_ID        (0x640200F5u)

#define CapSense_LINEARSLIDER0_GROUP3_END_VALUE             (CapSense_dsRam.gestures.group3End)
#define CapSense_LINEARSLIDER0_GROUP3_END_OFFSET            (246u)
#define CapSense_LINEARSLIDER0_GROUP3_END_SIZE              (1u)
#define CapSense_LINEARSLIDER0_GROUP3_END_PARAM_ID          (0x6E0200F6u)

#define CapSense_LINEARSLIDER0_GROUP4_START_VALUE           (CapSense_dsRam.gestures.group4Start)
#define CapSense_LINEARSLIDER0_GROUP4_START_OFFSET          (247u)
#define CapSense_LINEARSLIDER0_GROUP4_START_SIZE            (1u)
#define CapSense_LINEARSLIDER0_GROUP4_START_PARAM_ID        (0x680200F7u)

#define CapSense_LINEARSLIDER0_GROUP4_END_VALUE             (CapSense_dsRam.gestures.group4End)
#define CapSense_LINEARSLIDER0_GROUP4_END_OFFSET            (248u)
#define CapSense_LINEARSLIDER0_GROUP4_END_SIZE              (1u)
#define CapSense_LINEARSLIDER0_GROUP4_END_PARAM_ID          (0x610200F8u)

#define CapSense_TIMESTAMP_INTERVAL_VALUE                   (CapSense_dsRam.timestampInterval)
#define CapSense_TIMESTAMP_INTERVAL_OFFSET                  (252u)
#define CapSense_TIMESTAMP_INTERVAL_SIZE                    (4u)
#define CapSense_TIMESTAMP_INTERVAL_PARAM_ID                (0xCA0000FCu)

#define CapSense_TIMESTAMP_VALUE                            (CapSense_dsRam.timestamp)
#define CapSense_TIMESTAMP_OFFSET                           (256u)
#define CapSense_TIMESTAMP_SIZE                             (4u)
#define CapSense_TIMESTAMP_PARAM_ID                         (0xC3000100u)

#define CapSense_SNR_TEST_WIDGET_ID_VALUE                   (CapSense_dsRam.snrTestWidgetId)
#define CapSense_SNR_TEST_WIDGET_ID_OFFSET                  (260u)
#define CapSense_SNR_TEST_WIDGET_ID_SIZE                    (1u)
#define CapSense_SNR_TEST_WIDGET_ID_PARAM_ID                (0x6E000104u)

#define CapSense_SNR_TEST_SENSOR_ID_VALUE                   (CapSense_dsRam.snrTestSensorId)
#define CapSense_SNR_TEST_SENSOR_ID_OFFSET                  (261u)
#define CapSense_SNR_TEST_SENSOR_ID_SIZE                    (1u)
#define CapSense_SNR_TEST_SENSOR_ID_PARAM_ID                (0x68000105u)

#define CapSense_SNR_TEST_SCAN_COUNTER_VALUE                (CapSense_dsRam.snrTestScanCounter)
#define CapSense_SNR_TEST_SCAN_COUNTER_OFFSET               (262u)
#define CapSense_SNR_TEST_SCAN_COUNTER_SIZE                 (2u)
#define CapSense_SNR_TEST_SCAN_COUNTER_PARAM_ID             (0x81000106u)

#define CapSense_SNR_TEST_RAW_COUNT0_VALUE                  (CapSense_dsRam.snrTestRawCount[0u])
#define CapSense_SNR_TEST_RAW_COUNT0_OFFSET                 (264u)
#define CapSense_SNR_TEST_RAW_COUNT0_SIZE                   (2u)
#define CapSense_SNR_TEST_RAW_COUNT0_PARAM_ID               (0x8E000108u)


/*****************************************************************************/
/* Flash Data structure register definitions                                 */
/*****************************************************************************/
#define CapSense_BUTTONR_PTR2SNS_FLASH_VALUE                (CapSense_dsFlash.wdgtArray[0].ptr2SnsFlash)
#define CapSense_BUTTONR_PTR2SNS_FLASH_OFFSET               (0u)
#define CapSense_BUTTONR_PTR2SNS_FLASH_SIZE                 (4u)
#define CapSense_BUTTONR_PTR2SNS_FLASH_PARAM_ID             (0xD1000000u)

#define CapSense_BUTTONR_PTR2WD_RAM_VALUE                   (CapSense_dsFlash.wdgtArray[0].ptr2WdgtRam)
#define CapSense_BUTTONR_PTR2WD_RAM_OFFSET                  (4u)
#define CapSense_BUTTONR_PTR2WD_RAM_SIZE                    (4u)
#define CapSense_BUTTONR_PTR2WD_RAM_PARAM_ID                (0xD0000004u)

#define CapSense_BUTTONR_PTR2SNS_RAM_VALUE                  (CapSense_dsFlash.wdgtArray[0].ptr2SnsRam)
#define CapSense_BUTTONR_PTR2SNS_RAM_OFFSET                 (8u)
#define CapSense_BUTTONR_PTR2SNS_RAM_SIZE                   (4u)
#define CapSense_BUTTONR_PTR2SNS_RAM_PARAM_ID               (0xD3000008u)

#define CapSense_BUTTONR_PTR2FLTR_HISTORY_VALUE             (CapSense_dsFlash.wdgtArray[0].ptr2FltrHistory)
#define CapSense_BUTTONR_PTR2FLTR_HISTORY_OFFSET            (12u)
#define CapSense_BUTTONR_PTR2FLTR_HISTORY_SIZE              (4u)
#define CapSense_BUTTONR_PTR2FLTR_HISTORY_PARAM_ID          (0xD200000Cu)

#define CapSense_BUTTONR_PTR2DEBOUNCE_VALUE                 (CapSense_dsFlash.wdgtArray[0].ptr2DebounceArr)
#define CapSense_BUTTONR_PTR2DEBOUNCE_OFFSET                (16u)
#define CapSense_BUTTONR_PTR2DEBOUNCE_SIZE                  (4u)
#define CapSense_BUTTONR_PTR2DEBOUNCE_PARAM_ID              (0xD4000010u)

