NicPare/GBM2100/Laboratoire3.cydsn/Generated_Source/PSoC6/CapSense_RegisterMap.h
#define CapSense_BUTTONR_STATIC_CONFIG_VALUE                (CapSense_dsFlash.wdgtArray[0].staticConfig)
#define CapSense_BUTTONR_STATIC_CONFIG_OFFSET               (20u)
#define CapSense_BUTTONR_STATIC_CONFIG_SIZE                 (4u)
#define CapSense_BUTTONR_STATIC_CONFIG_PARAM_ID             (0xD5000014u)

#define CapSense_BUTTONR_TOTAL_NUM_SNS_VALUE                (CapSense_dsFlash.wdgtArray[0].totalNumSns)
#define CapSense_BUTTONR_TOTAL_NUM_SNS_OFFSET               (24u)
#define CapSense_BUTTONR_TOTAL_NUM_SNS_SIZE                 (2u)
#define CapSense_BUTTONR_TOTAL_NUM_SNS_PARAM_ID             (0x99000018u)

#define CapSense_BUTTONR_TYPE_VALUE                         (CapSense_dsFlash.wdgtArray[0].wdgtType)
#define CapSense_BUTTONR_TYPE_OFFSET                        (26u)
#define CapSense_BUTTONR_TYPE_SIZE                          (1u)
#define CapSense_BUTTONR_TYPE_PARAM_ID                      (0x5D00001Au)

#define CapSense_BUTTONR_SENSE_METHOD_VALUE                 (CapSense_dsFlash.wdgtArray[0].senseMethod)
#define CapSense_BUTTONR_SENSE_METHOD_OFFSET                (27u)
#define CapSense_BUTTONR_SENSE_METHOD_SIZE                  (1u)
#define CapSense_BUTTONR_SENSE_METHOD_PARAM_ID              (0x5B00001Bu)

#define CapSense_BUTTONR_NUM_COLS_VALUE                     (CapSense_dsFlash.wdgtArray[0].numCols)
#define CapSense_BUTTONR_NUM_COLS_OFFSET                    (28u)
#define CapSense_BUTTONR_NUM_COLS_SIZE                      (1u)
#define CapSense_BUTTONR_NUM_COLS_PARAM_ID                  (0x5000001Cu)

#define CapSense_BUTTONR_NUM_ROWS_VALUE                     (CapSense_dsFlash.wdgtArray[0].numRows)
#define CapSense_BUTTONR_NUM_ROWS_OFFSET                    (29u)
#define CapSense_BUTTONR_NUM_ROWS_SIZE                      (1u)
#define CapSense_BUTTONR_NUM_ROWS_PARAM_ID                  (0x5600001Du)

#define CapSense_BUTTONR_X_RESOLUTION_VALUE                 (CapSense_dsFlash.wdgtArray[0].xResolution)
#define CapSense_BUTTONR_X_RESOLUTION_OFFSET                (30u)
#define CapSense_BUTTONR_X_RESOLUTION_SIZE                  (2u)
#define CapSense_BUTTONR_X_RESOLUTION_PARAM_ID              (0x9400001Eu)

#define CapSense_BUTTONR_X_CENT_MULT_VALUE                  (CapSense_dsFlash.wdgtArray[0].xCentroidMultiplier)
#define CapSense_BUTTONR_X_CENT_MULT_OFFSET                 (32u)
#define CapSense_BUTTONR_X_CENT_MULT_SIZE                   (4u)
#define CapSense_BUTTONR_X_CENT_MULT_PARAM_ID               (0xDB000020u)

#define CapSense_BUTTONR_PTR2NOISE_ENVLP_VALUE              (CapSense_dsFlash.wdgtArray[0].ptr2NoiseEnvlp)
#define CapSense_BUTTONR_PTR2NOISE_ENVLP_OFFSET             (36u)
#define CapSense_BUTTONR_PTR2NOISE_ENVLP_SIZE               (4u)
#define CapSense_BUTTONR_PTR2NOISE_ENVLP_PARAM_ID           (0xDA000024u)

#define CapSense_BUTTONR_IIR_FILTER_COEFF_VALUE             (CapSense_dsFlash.wdgtArray[0].iirFilterCoeff)
#define CapSense_BUTTONR_IIR_FILTER_COEFF_OFFSET            (40u)
#define CapSense_BUTTONR_IIR_FILTER_COEFF_SIZE              (1u)
#define CapSense_BUTTONR_IIR_FILTER_COEFF_PARAM_ID          (0x5E000028u)

#define CapSense_BUTTONL_PTR2SNS_FLASH_VALUE                (CapSense_dsFlash.wdgtArray[1].ptr2SnsFlash)
#define CapSense_BUTTONL_PTR2SNS_FLASH_OFFSET               (44u)
#define CapSense_BUTTONL_PTR2SNS_FLASH_SIZE                 (4u)
#define CapSense_BUTTONL_PTR2SNS_FLASH_PARAM_ID             (0xDB01002Cu)

#define CapSense_BUTTONL_PTR2WD_RAM_VALUE                   (CapSense_dsFlash.wdgtArray[1].ptr2WdgtRam)
#define CapSense_BUTTONL_PTR2WD_RAM_OFFSET                  (48u)
#define CapSense_BUTTONL_PTR2WD_RAM_SIZE                    (4u)
#define CapSense_BUTTONL_PTR2WD_RAM_PARAM_ID                (0xDD010030u)

#define CapSense_BUTTONL_PTR2SNS_RAM_VALUE                  (CapSense_dsFlash.wdgtArray[1].ptr2SnsRam)
#define CapSense_BUTTONL_PTR2SNS_RAM_OFFSET                 (52u)
#define CapSense_BUTTONL_PTR2SNS_RAM_SIZE                   (4u)
#define CapSense_BUTTONL_PTR2SNS_RAM_PARAM_ID               (0xDC010034u)

#define CapSense_BUTTONL_PTR2FLTR_HISTORY_VALUE             (CapSense_dsFlash.wdgtArray[1].ptr2FltrHistory)
#define CapSense_BUTTONL_PTR2FLTR_HISTORY_OFFSET            (56u)
#define CapSense_BUTTONL_PTR2FLTR_HISTORY_SIZE              (4u)
#define CapSense_BUTTONL_PTR2FLTR_HISTORY_PARAM_ID          (0xDF010038u)

#define CapSense_BUTTONL_PTR2DEBOUNCE_VALUE                 (CapSense_dsFlash.wdgtArray[1].ptr2DebounceArr)
#define CapSense_BUTTONL_PTR2DEBOUNCE_OFFSET                (60u)
#define CapSense_BUTTONL_PTR2DEBOUNCE_SIZE                  (4u)
#define CapSense_BUTTONL_PTR2DEBOUNCE_PARAM_ID              (0xDE01003Cu)

#define CapSense_BUTTONL_STATIC_CONFIG_VALUE                (CapSense_dsFlash.wdgtArray[1].staticConfig)
#define CapSense_BUTTONL_STATIC_CONFIG_OFFSET               (64u)
#define CapSense_BUTTONL_STATIC_CONFIG_SIZE                 (4u)
#define CapSense_BUTTONL_STATIC_CONFIG_PARAM_ID             (0xDF010040u)

#define CapSense_BUTTONL_TOTAL_NUM_SNS_VALUE                (CapSense_dsFlash.wdgtArray[1].totalNumSns)
#define CapSense_BUTTONL_TOTAL_NUM_SNS_OFFSET               (68u)
#define CapSense_BUTTONL_TOTAL_NUM_SNS_SIZE                 (2u)
#define CapSense_BUTTONL_TOTAL_NUM_SNS_PARAM_ID             (0x91010044u)

#define CapSense_BUTTONL_TYPE_VALUE                         (CapSense_dsFlash.wdgtArray[1].wdgtType)
#define CapSense_BUTTONL_TYPE_OFFSET                        (70u)
#define CapSense_BUTTONL_TYPE_SIZE                          (1u)
#define CapSense_BUTTONL_TYPE_PARAM_ID                      (0x55010046u)

#define CapSense_BUTTONL_SENSE_METHOD_VALUE                 (CapSense_dsFlash.wdgtArray[1].senseMethod)
#define CapSense_BUTTONL_SENSE_METHOD_OFFSET                (71u)
#define CapSense_BUTTONL_SENSE_METHOD_SIZE                  (1u)
#define CapSense_BUTTONL_SENSE_METHOD_PARAM_ID              (0x53010047u)

#define CapSense_BUTTONL_NUM_COLS_VALUE                     (CapSense_dsFlash.wdgtArray[1].numCols)
#define CapSense_BUTTONL_NUM_COLS_OFFSET                    (72u)
#define CapSense_BUTTONL_NUM_COLS_SIZE                      (1u)
#define CapSense_BUTTONL_NUM_COLS_PARAM_ID                  (0x5A010048u)

