NicPare/GBM2100/Laboratoire3.cydsn/Generated_Source/PSoC6/CapSense_RegisterMap.h
#define CapSense_BUTTONL_NUM_ROWS_VALUE                     (CapSense_dsFlash.wdgtArray[1].numRows)
#define CapSense_BUTTONL_NUM_ROWS_OFFSET                    (73u)
#define CapSense_BUTTONL_NUM_ROWS_SIZE                      (1u)
#define CapSense_BUTTONL_NUM_ROWS_PARAM_ID                  (0x5C010049u)

#define CapSense_BUTTONL_X_RESOLUTION_VALUE                 (CapSense_dsFlash.wdgtArray[1].xResolution)
#define CapSense_BUTTONL_X_RESOLUTION_OFFSET                (74u)
#define CapSense_BUTTONL_X_RESOLUTION_SIZE                  (2u)
#define CapSense_BUTTONL_X_RESOLUTION_PARAM_ID              (0x9E01004Au)

#define CapSense_BUTTONL_X_CENT_MULT_VALUE                  (CapSense_dsFlash.wdgtArray[1].xCentroidMultiplier)
#define CapSense_BUTTONL_X_CENT_MULT_OFFSET                 (76u)
#define CapSense_BUTTONL_X_CENT_MULT_SIZE                   (4u)
#define CapSense_BUTTONL_X_CENT_MULT_PARAM_ID               (0xDC01004Cu)

#define CapSense_BUTTONL_PTR2NOISE_ENVLP_VALUE              (CapSense_dsFlash.wdgtArray[1].ptr2NoiseEnvlp)
#define CapSense_BUTTONL_PTR2NOISE_ENVLP_OFFSET             (80u)
#define CapSense_BUTTONL_PTR2NOISE_ENVLP_SIZE               (4u)
#define CapSense_BUTTONL_PTR2NOISE_ENVLP_PARAM_ID           (0xDA010050u)

#define CapSense_BUTTONL_IIR_FILTER_COEFF_VALUE             (CapSense_dsFlash.wdgtArray[1].iirFilterCoeff)
#define CapSense_BUTTONL_IIR_FILTER_COEFF_OFFSET            (84u)
#define CapSense_BUTTONL_IIR_FILTER_COEFF_SIZE              (1u)
#define CapSense_BUTTONL_IIR_FILTER_COEFF_PARAM_ID          (0x5C010054u)

#define CapSense_LINEARSLIDER0_PTR2SNS_FLASH_VALUE          (CapSense_dsFlash.wdgtArray[2].ptr2SnsFlash)
#define CapSense_LINEARSLIDER0_PTR2SNS_FLASH_OFFSET         (88u)
#define CapSense_LINEARSLIDER0_PTR2SNS_FLASH_SIZE           (4u)
#define CapSense_LINEARSLIDER0_PTR2SNS_FLASH_PARAM_ID       (0xDD020058u)

#define CapSense_LINEARSLIDER0_PTR2WD_RAM_VALUE             (CapSense_dsFlash.wdgtArray[2].ptr2WdgtRam)
#define CapSense_LINEARSLIDER0_PTR2WD_RAM_OFFSET            (92u)
#define CapSense_LINEARSLIDER0_PTR2WD_RAM_SIZE              (4u)
#define CapSense_LINEARSLIDER0_PTR2WD_RAM_PARAM_ID          (0xDC02005Cu)

#define CapSense_LINEARSLIDER0_PTR2SNS_RAM_VALUE            (CapSense_dsFlash.wdgtArray[2].ptr2SnsRam)
#define CapSense_LINEARSLIDER0_PTR2SNS_RAM_OFFSET           (96u)
#define CapSense_LINEARSLIDER0_PTR2SNS_RAM_SIZE             (4u)
#define CapSense_LINEARSLIDER0_PTR2SNS_RAM_PARAM_ID         (0xD0020060u)

#define CapSense_LINEARSLIDER0_PTR2FLTR_HISTORY_VALUE       (CapSense_dsFlash.wdgtArray[2].ptr2FltrHistory)
#define CapSense_LINEARSLIDER0_PTR2FLTR_HISTORY_OFFSET      (100u)
#define CapSense_LINEARSLIDER0_PTR2FLTR_HISTORY_SIZE        (4u)
#define CapSense_LINEARSLIDER0_PTR2FLTR_HISTORY_PARAM_ID    (0xD1020064u)

#define CapSense_LINEARSLIDER0_PTR2DEBOUNCE_VALUE           (CapSense_dsFlash.wdgtArray[2].ptr2DebounceArr)
#define CapSense_LINEARSLIDER0_PTR2DEBOUNCE_OFFSET          (104u)
#define CapSense_LINEARSLIDER0_PTR2DEBOUNCE_SIZE            (4u)
#define CapSense_LINEARSLIDER0_PTR2DEBOUNCE_PARAM_ID        (0xD2020068u)

#define CapSense_LINEARSLIDER0_STATIC_CONFIG_VALUE          (CapSense_dsFlash.wdgtArray[2].staticConfig)
#define CapSense_LINEARSLIDER0_STATIC_CONFIG_OFFSET         (108u)
#define CapSense_LINEARSLIDER0_STATIC_CONFIG_SIZE           (4u)
#define CapSense_LINEARSLIDER0_STATIC_CONFIG_PARAM_ID       (0xD302006Cu)

#define CapSense_LINEARSLIDER0_TOTAL_NUM_SNS_VALUE          (CapSense_dsFlash.wdgtArray[2].totalNumSns)
#define CapSense_LINEARSLIDER0_TOTAL_NUM_SNS_OFFSET         (112u)
#define CapSense_LINEARSLIDER0_TOTAL_NUM_SNS_SIZE           (2u)
#define CapSense_LINEARSLIDER0_TOTAL_NUM_SNS_PARAM_ID       (0x9A020070u)

#define CapSense_LINEARSLIDER0_TYPE_VALUE                   (CapSense_dsFlash.wdgtArray[2].wdgtType)
#define CapSense_LINEARSLIDER0_TYPE_OFFSET                  (114u)
#define CapSense_LINEARSLIDER0_TYPE_SIZE                    (1u)
#define CapSense_LINEARSLIDER0_TYPE_PARAM_ID                (0x5E020072u)

#define CapSense_LINEARSLIDER0_SENSE_METHOD_VALUE           (CapSense_dsFlash.wdgtArray[2].senseMethod)
#define CapSense_LINEARSLIDER0_SENSE_METHOD_OFFSET          (115u)
#define CapSense_LINEARSLIDER0_SENSE_METHOD_SIZE            (1u)
#define CapSense_LINEARSLIDER0_SENSE_METHOD_PARAM_ID        (0x58020073u)

#define CapSense_LINEARSLIDER0_NUM_COLS_VALUE               (CapSense_dsFlash.wdgtArray[2].numCols)
#define CapSense_LINEARSLIDER0_NUM_COLS_OFFSET              (116u)
#define CapSense_LINEARSLIDER0_NUM_COLS_SIZE                (1u)
#define CapSense_LINEARSLIDER0_NUM_COLS_PARAM_ID            (0x53020074u)

#define CapSense_LINEARSLIDER0_NUM_ROWS_VALUE               (CapSense_dsFlash.wdgtArray[2].numRows)
#define CapSense_LINEARSLIDER0_NUM_ROWS_OFFSET              (117u)
#define CapSense_LINEARSLIDER0_NUM_ROWS_SIZE                (1u)
#define CapSense_LINEARSLIDER0_NUM_ROWS_PARAM_ID            (0x55020075u)

#define CapSense_LINEARSLIDER0_X_RESOLUTION_VALUE           (CapSense_dsFlash.wdgtArray[2].xResolution)
#define CapSense_LINEARSLIDER0_X_RESOLUTION_OFFSET          (118u)
#define CapSense_LINEARSLIDER0_X_RESOLUTION_SIZE            (2u)
#define CapSense_LINEARSLIDER0_X_RESOLUTION_PARAM_ID        (0x97020076u)

#define CapSense_LINEARSLIDER0_X_CENT_MULT_VALUE            (CapSense_dsFlash.wdgtArray[2].xCentroidMultiplier)
#define CapSense_LINEARSLIDER0_X_CENT_MULT_OFFSET           (120u)
#define CapSense_LINEARSLIDER0_X_CENT_MULT_SIZE             (4u)
#define CapSense_LINEARSLIDER0_X_CENT_MULT_PARAM_ID         (0xD7020078u)

#define CapSense_LINEARSLIDER0_PTR2NOISE_ENVLP_VALUE        (CapSense_dsFlash.wdgtArray[2].ptr2NoiseEnvlp)
#define CapSense_LINEARSLIDER0_PTR2NOISE_ENVLP_OFFSET       (124u)
#define CapSense_LINEARSLIDER0_PTR2NOISE_ENVLP_SIZE         (4u)
#define CapSense_LINEARSLIDER0_PTR2NOISE_ENVLP_PARAM_ID     (0xD602007Cu)

#define CapSense_LINEARSLIDER0_IIR_FILTER_COEFF_VALUE       (CapSense_dsFlash.wdgtArray[2].iirFilterCoeff)
#define CapSense_LINEARSLIDER0_IIR_FILTER_COEFF_OFFSET      (128u)
#define CapSense_LINEARSLIDER0_IIR_FILTER_COEFF_SIZE        (1u)
#define CapSense_LINEARSLIDER0_IIR_FILTER_COEFF_PARAM_ID    (0x53020080u)


#endif /* End CY_SENSE_CapSense_REGISTER_MAP_H */


/* [] END OF FILE */
